---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoad
source: html/3b1056bf-44ce-9d34-0f48-aaa3a761772d.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoad Property

The ApparentLoad value of the Electrical System.

## Syntax (C#)
```csharp
public double ApparentLoad { get; }
```

## Remarks
This property is used to retrieve the ApparentLoad value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!